{
    "head": {
        "name": "Alexis",
        "phone": "06 00 00 00 00",
        "email": "",
        "general_title": "Data Architecture Specialist from Ecole des Ponts ParisTech"
    },
    "experiences": {
        "intitule_section": "Expérience Professionnelle",
        "experiences": [
            {
                "post": "Senior Data Scientist",
                "company": "EY",
                "location": "Paris, France",
                "dates": "Février 2023 – Présent",
                "bullets": [
                    "Conception et déploiement d'un Data Hub sur GCP pour centraliser les données constructeur et bancaires chez Renault.",
                    "Intégration de dbt, pipelines CI/CD et Docker sur Cloud Run pour des projets IA stratégiques.",
                    "Optimisation des échanges de données pour Enedis, améliorant la qualité et la fiabilité des flux de données."
                ]
            },
            {
                "post": "Co-fondateur et CTO",
                "company": "Kadi",
                "location": "Paris, France",
                "dates": "Décembre 2022 – Présent",
                "bullets": [
                    "Conception de l'architecture technique et choix des technologies, notamment Flutter et GCP.",
                    "Développement et déploiement d'un modèle Faster R-CNN pour la détection automatique de tickets de caisse.",
                    "Supervision des processus de développement collaboratif et structuration des workflows."
                ]
            },
            {
                "post": "Ingénieur - transformation digitale",
                "company": "Blispac",
                "location": "France",
                "dates": "Février 2022 – Septembre 2022",
                "bullets": [
                    "Digitalisation de l'entreprise avec la structuration des bases de données SQL.",
                    "Mise en place d'un algorithme génétique pour optimiser les processus de fabrication.",
                    "Automatisation d'un banc de test pour prothèses de hanches."
                ]
            },
            {
                "post": "Analyste de marché LNG",
                "company": "TotalEnergies",
                "location": "Paris, France",
                "dates": "Février 2020 – Juillet 2020",
                "bullets": [
                    "Analyse des marchés mondiaux de GNL et d'électricité pour le Total Energy Outlook.",
                    "Développement d'un algorithme en Python pour analyser les routes des méthaniers GNL.",
                    "Automatisation des workflows de données avec Pandas."
                ]
            }
        ]
    },
    "education": {
        "intitule_section": "Éducation",
        "educations": [
            {
                "intitule": "MSc en Ingénierie Mathématique",
                "etablissement": "Politecnico di Milano",
                "dates": "2021 – 2022",
                "description": "Spécialisation en Energy Finance avec un focus sur les modèles de tarification du gaz naturel et des options swing. Cours suivis en Computational Finance, incluant des modèles stochastiques et des méthodes numériques pour les dérivés financiers. Études en théorie des jeux et apprentissage machine, avec des compétences en analyse prédictive et optimisation dans des systèmes complexes."
            },
            {
                "intitule": "Master en Ingénierie Civile",
                "etablissement": "École des Ponts ParisTech",
                "dates": "2017 – 2022",
                "description": "Formation généraliste en ingénierie civile avec une spécialisation en optimisation linéaire, statistiques et mathématiques appliquées. Développement de compétences avancées en résolution de problèmes complexes et analyse quantitative. Projet majeur : optimisation logistique et gestion des chaînes d'approvisionnement dans des environnements industriels."
            },
            {
                "intitule": "Classe préparatoire scientifique",
                "etablissement": "Collège Stanislas Paris",
                "dates": "2015 – 2017",
                "description": "Formation intensive en mathématiques, physique et sciences de l’ingénieur. Préparation aux concours des grandes écoles d’ingénieurs, acquérant des bases solides en analyse et en résolution de problèmes complexes."
            }
        ]
    },
    "skills": {
        "intitule_section": "Skills",
        "skills": {
            "Langages": [
                "Python",
                "SQL",
                "C++"
            ],
            "Frameworks": [
                "TensorFlow",
                "PyTorch",
                "Scikit-learn",
                "XGBoost"
            ],
            "Cloud/DevOps": [
                "GCP",
                "AWS",
                "Docker",
                "Kubernetes"
            ],
            "Outils Data": [
                "BigQuery",
                "Airflow",
                "dbt",
                "Spark"
            ],
            "Mathématiques": [
                "Optimisation",
                "Statistiques",
                "Probabilités"
            ]
        }
    },
    "hobbies": {
        "intitule_section": "Hobbies",
        "hobbies": "J'aime la musique, le sport et les jeux vidéos."
    }
}