[
    {
        "order": 1,
        "post": "Senior Data Scientist",
        "company": "EY",
        "location": "Paris, France",
        "dates": "February 2023 – Present",
        "description": "Pilotage de la transformation des pipelines de données pour Renault dans le cadre de projets stratégiques liés au leasing et au véhicule électrique. Mise en place d'une architecture dbt sur Cloud Run, accompagnée de pipelines CI/CD modernes. Encadrement d'une équipe de 5 data engineers et implémentation de solutions DevOps pour améliorer la qualité et la rapidité des workflows. Développement d’un assistant conversationnel (Talk To Data) et de modèles Machine Learning pour l’estimation des valeurs résiduelles (VR). Transition réussie des processus traditionnels vers des solutions cloud natives tout en garantissant la conformité avec les normes de sécurité du groupe."
    },
    {
        "order": 2,
        "post": "Co-fondateur et CTO",
        "company": "Kadi",
        "location": "Paris, France",
        "dates": "December 2022 – Present",
        "description": "Définition de l’architecture technique et choix des technologies adaptées (Flutter pour le front-end, GCP pour le back-end). Développement d’un modèle Faster R-CNN pour la détection et l’analyse automatique de tickets de caisse, déployé sur Google App Engine pour une scalabilité optimale. Conception de pipelines de données automatisés avec Cloud Functions, BigQuery et Firestore. Supervision du déploiement de l'application sur Google Play et Apple Store en version bêta, validée par une communauté d'utilisateurs. Intégration de bonnes pratiques MLOps pour la gestion des modèles en production, incluant surveillance et mise à jour automatisées."
    },
    {
        "order": 3,
        "post": "Ingénieur en Transformation Digitale",
        "company": "Blispac",
        "location": "Balagny-sur-Thérain, France",
        "dates": "February 2022 – September 2022",
        "description": "Conduite de projets stratégiques de digitalisation, incluant la structuration des bases de données SQL et la mise à jour de l’ERP pour une meilleure traçabilité et gestion des commandes. Développement d’un algorithme génétique pour optimiser le positionnement des pièces dans les moules, réduisant les pertes de matériaux. Automatisation d’un banc de test pour prothèses médicales, améliorant la conformité aux normes ISO et réduisant les temps de validation des prototypes."
    },
    {
        "order": 4,
        "post": "Consultant en Stratégie et Supply Chain",
        "company": "Diagma",
        "location": "Paris, France",
        "dates": "September 2021 – February 2022",
        "description": "Participation à des missions stratégiques pour des clients de renom, incluant l’optimisation de la production pour Hermès via des modèles d’optimisation linéaire. Gestion d’une opération de Sale & Leaseback pour un entrepôt logistique de 70 000 m². Développement de modèles de prévision avancés avec AZAP pour améliorer la précision des prévisions et optimiser les niveaux de stock."
    },
    {
        "order": 5,
        "post": "Analyste de Marché",
        "company": "TotalEnergies",
        "location": "Paris, France",
        "dates": "February 2020 – July 2020",
        "description": "Contribution à l’analyse stratégique des marchés énergétiques mondiaux dans le cadre du Total Energy Outlook. Développement d’un algorithme en Python pour analyser en temps réel les flux de tankers GNL, utilisant des méthodologies inédites inspirées du marché pétrolier. Création d’indicateurs innovants pour le suivi des dynamiques du marché GNL, appuyés par des visualisations interactives sur Power BI."
    },
    {
        "order": 6,
        "post": "Coordinateur de Projets",
        "company": "L’Œuvre d’Orient",
        "location": "Erbil, Irak",
        "dates": "June 2019 – February 2020",
        "description": "Supervision d’un portefeuille de plus de 100 projets humanitaires, incluant la reconstruction d’écoles, d’hôpitaux et de réseaux d’eau potable. Gestion d’une équipe multiculturelle et coordination avec des donateurs et partenaires internationaux pour garantir la réussite des projets. Réalisation de projets emblématiques tels que l’installation de systèmes solaires pour des villages isolés et la réhabilitation de villages déplacés."
    },
    {
        "order": 7,
        "post": "Consultant Junior",
        "company": "Cdiscount",
        "location": "France",
        "dates": "October 2018 – February 2019",
        "description": "Optimisation des entrepôts logistiques via des analyses quantitatives approfondies et des solutions basées sur le Vehicle Routing Problem (VRP). Collaboration avec des équipes techniques pour améliorer les processus de gestion des flux logistiques."
    }
]